# Built In Failures Sheet Failures Sheet Scale Override Invalid Property

Source: https://www.revitapidocs.com/2026/ba78ff06-2be8-28ea-3f71-d9e337cc996a.htm

---

| Built In Failures Sheet Failures Sheet Scale Override Invalid Property |
| --- |

The scale override parameter can only contain text, numeric values are not supported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId SheetScaleOverrideInvalid { get; }
```

```
Public Shared ReadOnly Property SheetScaleOverrideInvalid As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ SheetScaleOverrideInvalid {
	FailureDefinitionId^ get ();
}
```

```
static member SheetScaleOverrideInvalid : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures SheetFailures Class Autodesk.Revit.DB Namespace